app/views/books/show.html.erb


<% @book.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."book_id" = $1  [["book_id", 2]]