app/controllers/books_controller.rb

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "name" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["name", "COOKIN’ WITH COOLIO 2"], ["updated_at", 2016-11-09 18:24:59 UTC], ["id", 2]]

  def create
    @book = Book.create!(book_params)
---
INSERT INTO "books" ("name", "bookType", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Some"], ["bookType", "asdf"], ["created_at", 2016-11-09 18:56:52 UTC], ["updated_at", 2016-11-09 18:56:52 UTC]]