app/controllers/recipes_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:book_id])
    @recipe = Recipe.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:book_id])
    @recipe = Recipe.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = $1, "steps" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["title", "New name"], ["steps", "Find a Karada  Kill it  Eat it"], ["updated_at", 2016-11-09 14:53:31 UTC], ["id", 8]]
---
  def update
    @book = Book.find(params[:book_id])
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @book = Book.find(params[:book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "recipes" ("title", "ingredients", "steps", "img_url", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = Book.find(params[:book_id])
    @recipe = @book.recipes.create!(recipe_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 9]]
---
  def destroy
    @book = Book.find(params[:book_id])
    @recipe = Recipe.find(params[:id])
    @recipe.destroy